{"keras_version": "2.3.1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 28, 28, 1], "filters": 32, "activation": "relu", "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 32, "activation": "relu", "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "activation": "relu", "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "activation": "relu", "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 256, "dtype": "float32", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_3", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 10, "dtype": "float32", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}]}, "backend": "tensorflow"}